<div style="text-align: center; background-color: #5A96E3; font-family: 'Trebuchet MS', Arial, sans-serif; color: white; padding: 20px; font-size: 40px; font-weight: bold; border-radius: 0 0 0 0; box-shadow: 0px 6px 8px rgba(0, 0, 0, 0.2);">
  Data Modeling
</div>

In [176]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [177]:
production_df = pd.read_csv('../data/processed/preprocess_QCL.csv')
element_df = pd.read_csv('../data/external/element_code.csv')
item_df = pd.read_csv('../data/external/item_code.csv')
production_df.head()

,Domain Code,Area Code,Element Code,Item Code,Year,Unit,Value,Flag,Note
0,QCL,237,5312,711,1961,ha,1000.0,E,NaN
1,QCL,237,5419,711,1961,100 g/ha,7000.0,E,NaN
2,QCL,237,5510,711,1961,t,700.0,E,NaN
3,QCL,237,5312,711,1962,ha,1000.0,E,NaN
4,QCL,237,5419,711,1962,100 g/ha,7000.0,E,NaN

In [178]:
print(len(production_df['Item Code'].unique()))
print(len(production_df['Unit'].unique()))
print(len(production_df['Year'].unique()))
print(len(production_df['Element Code'].unique()))

122
12
61
18

In [179]:
production_df['Unit'].unique()

array(['ha', '100 g/ha', 't', 'No', 'An', '1000 An', '100 mg/An', 'No/An',
       '1000 No', '100 g/An', '0.1 g/An', '100 g'], dtype=object)

In [180]:
production_df['Year'].unique()

array([1961, 1962, 1963, 1964, 1965, 1966, 1967, 1968, 1969, 1970, 1971,
       1972, 1973, 1974, 1975, 1976, 1977, 1978, 1979, 1980, 1981, 1982,
       1983, 1984, 1985, 1986, 1987, 1988, 1989, 1990, 1991, 1992, 1993,
       1994, 1995, 1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004,
       2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015,
       2016, 2017, 2018, 2019, 2020, 2021], dtype=int64)

In [181]:
production_df['Flag'].unique()

array(['E', 'I', 'M', 'A', 'X'], dtype=object)

In [182]:
production_df[production_df['Element Code'] == 5510]

,Domain Code,Area Code,Element Code,Item Code,Year,Unit,Value,Flag,Note
2,QCL,237,5510,711,1961,t,700.00,E,NaN
5,QCL,237,5510,711,1962,t,700.00,E,NaN
8,QCL,237,5510,711,1963,t,700.00,E,NaN
11,QCL,237,5510,711,1964,t,850.00,E,NaN
14,QCL,237,5510,711,1965,t,870.00,E,NaN
...,...,...,...,...,...,...,...,...,...
15057,QCL,237,5510,1735,2017,t,15723915.48,E,NaN
15060,QCL,237,5510,1735,2018,t,16266791.68,E,NaN
15063,QCL,237,5510,1735,2019,t,16674164.74,E,NaN
15066,QCL,237,5510,1735,2020,t,17006433.11,E,NaN
15069,QCL,237,5510,1735,2021,t,17224210.24,E,NaN

In [183]:
production_df = production_df[production_df.Flag != 'M']
new_data = production_df.drop(columns=['Note', 'Domain Code', 'Area Code', 'Flag', 'Unit'])
new_data = new_data[new_data['Element Code'] == 5510]

In [184]:
element_df[element_df['Element Code'] == new_data['Element Code'].values[0]].Element.values[0]

'Production (t)'

In [185]:
element = element_df[element_df['Element Code'] == new_data['Element Code'].values[0]].Element.values[0]
new_data = new_data.rename(columns={"Value" : f"{element}"})

In [186]:
new_data

       Element Code  Item Code  Year Unit  Production (t)
2              5510        711  1961    t          700.00
5              5510        711  1962    t          700.00
8              5510        711  1963    t          700.00
11             5510        711  1964    t          850.00
14             5510        711  1965    t          870.00
...             ...        ...   ...  ...             ...
15057          5510       1735  2017    t     15723915.48
15060          5510       1735  2018    t     16266791.68
15063          5510       1735  2019    t     16674164.74
15066          5510       1735  2020    t     17006433.11
15069          5510       1735  2021    t     17224210.24

[5605 rows x 5 columns]